In [2]:
import pandas as pd
import sqlite3 as sql

In [17]:
conn = sql.connect("../../data/pokemon.sqlite")

In [4]:
cur = conn.cursor()

In [7]:
tables = list(cur.execute("SELECT name FROM sqlite_master WHERE type='table';"))

tables

[('pokemon',), ('types',), ('pokemon_types',)]

In [13]:
query = "SELECT * FROM pokemon;"
pokemon = list(cur.execute(query))
cur.close()

pokemon = pd.DataFrame(pokemon)

pokemon.head(5)

   0           1  2   3     4    5  6  7
0  1   bulbasaur  1   7    69   64  1  1
1  2     ivysaur  2  10   130  142  2  1
2  3    venusaur  3  20  1000  236  3  1
3  4  charmander  4   6    85   62  5  1
4  5  charmeleon  5  11   190  142  6  1

In [23]:
cur = conn.cursor()

list(cur.execute("PRAGMA table_info(pokemon);"))

[(0, 'id', 'INTEGER', 0, None, 0),
 (1, 'identifier', 'TEXT', 0, None, 0),
 (2, 'species_id', 'INTEGER', 0, None, 0),
 (3, 'height', 'INTEGER', 0, None, 0),
 (4, 'weight', 'INTEGER', 0, None, 0),
 (5, 'base_experience', 'INTEGER', 0, None, 0),
 (6, 'order', 'INTEGER', 0, None, 0),
 (7, 'is_default', 'INTEGER', 0, None, 0)]

In [15]:
conn.close()